app/controllers/posts_controller.rb

INSERT INTO "posts" ("created_at", "text", "title", "updated_at") VALUES (?, ?, ?, ?)
---
  def create
    @post = Post.new(post_params)

    respond_to do |format|
      if @post.save

UPDATE "posts" SET "title" = ?, "text" = ?, "updated_at" = ? WHERE "posts"."id" = 1  [["title", "Uğur"], ["text", "KANTEKİN"], ["updated_at", Thu, 07 Nov 2013 15:02:51 UTC +00:00]]
---
  def update
    respond_to do |format|
      if @post.update(post_params)